models/FieldTypeQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `field_type`