models/ProductFieldQuery.php

SELECT * FROM `product_field` WHERE `product_id`=43
---
    public function all($db = null)
    {
        return parent::all($db);